In [ ]:
## Top Pandas functions

In [1]:
import pandas as pd
#Series
d = {'a': 1, 'b': 2, 'c': 3}
ser = pd.Series(data=d, index=['a', 'b', 'c'])
ser

a    1
b    2
c    3
dtype: int64

In [2]:
d= [1,2,3,4,5]
ser= pd.Series(d)  #by default indexing is 
ser

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [3]:
#DataFrame
d = {'col1': [1, 2], 'col2': [3, 4]}
df = pd.DataFrame(d)
df

   col1  col2
0     1     3
1     2     4

In [5]:
# Read CSV 
pd.read_csv('Iris.csv')

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
0,1,5.1,3.5,1.4,0.2,Iris-setosa
1,2,4.9,3.0,1.4,0.2,Iris-setosa
2,3,4.7,3.2,1.3,0.2,Iris-setosa
3,4,4.6,3.1,1.5,0.2,Iris-setosa
4,5,5.0,3.6,1.4,0.2,Iris-setosa
...,...,...,...,...,...,...
145,146,6.7,3.0,5.2,2.3,Iris-virginica
146,147,6.3,2.5,5.0,1.9,Iris-virginica
147,148,6.5,3.0,5.2,2.0,Iris-virginica
148,149,6.2,3.4,5.4,2.3,Iris-virginica
149,150,5.9,3.0,5.1,1.8,Iris-virginica

In [8]:
df.select_dtypes(exclude ='float64')

   col1  col2
0     1     3
1     2     4

In [10]:
df.select_dtypes(exclude ='int64')

Empty DataFrame
Columns: []
Index: [0, 1]

In [12]:
df.value_counts()

col1  col2
1     3       1
2     4       1
dtype: int64

In [13]:
s = pd.Series([1, 2], index=["a", "b"])
s

a    1
b    2
dtype: int64

In [14]:
s_copy = s.copy()
s_copy

a    1
b    2
dtype: int64

In [15]:
shallow = s.copy(deep=False)  
shallow[0]= 6    #will modify original series
s

a    6
b    2
dtype: int64

In [16]:
import pandas as pd
import numpy as np
s = pd.Series(['cat', 'dog', np.nan, 'rabbit'])
s

0       cat
1       dog
2       NaN
3    rabbit
dtype: object

In [17]:
s.map({'cat': 'kitten', 'dog': 'puppy'})
s

0       cat
1       dog
2       NaN
3    rabbit
dtype: object

In [18]:
s.map({'cat1': 'kitten', 'dog': 'puppy'})
s

0       cat
1       dog
2       NaN
3    rabbit
dtype: object

In [19]:
s.map({'cat1': 'kitten', 'dog': 'puppy'})

0      NaN
1    puppy
2      NaN
3      NaN
dtype: object

In [21]:
#apply
df = pd.DataFrame([[4, 9]] * 3, columns=['A', 'B'])
df.apply(np.sqrt)

     A    B
0  2.0  3.0
1  2.0  3.0
2  2.0  3.0

In [22]:
df.apply(lambda x: [1, 2], axis=1)

0    [1, 2]
1    [1, 2]
2    [1, 2]
dtype: object

In [23]:
df.apply(lambda x: [1, 2], axis=0)

   A  B
0  1  1
1  2  2

In [24]:
pd.isna('dog') #checking for NaN value

False

In [26]:
pd.isna(pd.NA)

True

In [27]:
df.isin([0, 2])

       A      B
0  False  False
1  False  False
2  False  False

In [28]:
df = pd.DataFrame({'Animal': ['Falcon', 'Falcon','Parrot', 'Parrot'],'Max Speed': [380., 370., 24., 26.]})
df

   Animal  Max Speed
0  Falcon      380.0
1  Falcon      370.0
2  Parrot       24.0
3  Parrot       26.0

In [29]:
df.groupby(['Animal']).mean()

        Max Speed
Animal
Falcon      375.0
Parrot       25.0

In [30]:
df.groupby(['Animal']).count()['Max Speed']

Animal
Falcon    2
Parrot    2
Name: Max Speed, dtype: int64

In [31]:
df.groupby(['Animal']).median()

        Max Speed
Animal
Falcon      375.0
Parrot       25.0

In [32]:
df1 = pd.DataFrame({'lkey': ['foo', 'bar', 'baz', 'foo'],'value': [1, 2, 3, 5]})
df2 = pd.DataFrame({'rkey': ['foo', 'bar', 'baz', 'foo'],'value': [5, 6, 7, 8]})
df2

  rkey  value
0  foo      5
1  bar      6
2  baz      7
3  foo      8

In [33]:
df1

  lkey  value
0  foo      1
1  bar      2
2  baz      3
3  foo      5

In [34]:
df1.merge(df2, left_on='lkey', right_on='rkey')

  lkey  value_x rkey  value_y
0  foo        1  foo        5
1  foo        1  foo        8
2  foo        5  foo        5
3  foo        5  foo        8
4  bar        2  bar        6
5  baz        3  baz        7

In [35]:
df1.merge(df2)  #only last row

  lkey  value rkey
0  foo      5  foo

In [37]:
df = pd.DataFrame({'name': ['Raphael', 'Donatello'],'mask': ['red', 'purple'],'weapon': ['sai', 'bo staff']})
df.to_csv(index=False)

'name,mask,weapon\r\nRaphael,red,sai\r\nDonatello,purple,bo staff\r\n'

In [41]:
# join
# Creating dataframe a
a = pd.DataFrame({'id': [1, 2, 10, 12],'val1': ['a', 'b', 'c', 'd']})
b = pd.DataFrame({'id': [1, 2, 9, 8],'val1': ['p', 'q', 'r', 's']})

# inner join
df = pd.merge(a, b, on='id', how='inner')
df

   id val1_x val1_y
0   1      a      p
1   2      b      q

In [42]:
df = pd.merge(a, b, on='id', how='left')
df

   id val1_x val1_y
0   1      a      p
1   2      b      q
2  10      c    NaN
3  12      d    NaN

In [43]:
df = pd.merge(a, b, on='id', how='right')
df

   id val1_x val1_y
0   1      a      p
1   2      b      q
2   9    NaN      r
3   8    NaN      s

In [44]:
df = pd.merge(a, b, on='id', how='outer')
df

   id val1_x val1_y
0   1      a      p
1   2      b      q
2  10      c    NaN
3  12      d    NaN
4   9    NaN      r
5   8    NaN      s

In [45]:
result = df[['id']].aggregate('sum')
result

id    42
dtype: int64

In [46]:
a.join(b)

ValueError: columns overlap but no suffix specified: Index(['id', 'val1'], dtype='object')